import { Link } from 'react-router-dom';
// import { useState, useEffect } from 'react';
function Hot({ product, onAddToCart, categories }) {
    const Books = [
        {
            id: 2,
            img: "/imgs/books/1984.webp",
            alt: "رواية 1984",
            width: "245",
            height: "300",
            title: "رواية 1984",
            pref: "على مدى سنوات ظلت رواية ( 1984 ) لجورج أورويل تستعاد. يعود إليها الكتاب الذين يتحدثون عن الديكتاتوريةو الأنظمة الشمولية. و على مدى سنوات طويلة، ظلت هذه الرواية حية و تقرأ بسبب جماليتهاالأدبية والصورة السياسية الى قدمتها.",
        },
        {
            id: 3,
            img: "/imgs/books/أرض-السافلين.webp",
            alt: "رواية ارض السافلين",
            width: "245",
            height: "300",
            title: "رواية ارض السافلين",
            pref: "هي الأرض التي تخون فيها زوجتك، و تبيع فيها دولتك و تكفر فيها بربك.. ولا تبالي.. فكل قانون علي هذه الأرض سقط.. و كل قناع على هذا الوجه انكسر.. ولم تعد فيها إلا سافلاً.. تسير مع السافلين.. ولا تبالي.",
        },
        {
            id: 4,
            img: "/imgs/books/ملائك-نصيبين.webp",
            alt: "رواية ملائك نصيبين",
            width: "245",
            height: "300",
            title: "رواية ملائك نصيبين",
            pref: "وإن كُنّا ملائك ولسنا ملائكة.. وما عبدنا إلا الواحد الأحد وإن في هذه الدنيا أجناس ..نفوس تهيم بلا جسد وإن سيرتنا قد أنورت وأبهرت.. في كل أسطورة عاشت إلى الأبد وأن هذا أوانها لنحكيها ونسردها ... فتبلغ كل ذي عقل ورشد",
        },
        {
            id: 5,
            img: "/imgs/books/الرصد.webp",
            alt: "رواية الرصد",
            width: "245",
            height: "300",
            title: "رواية الرصد",
            pref: "وكان الجزء الأول من الرواية نشر تحت عنوان 'ليلة فى جهنم: منزل أبو خطوة'، والتى صدرت مطلع العام الجارى، بالتزامن مع معرض القاهرة للكتاب 2017، وكانت تدور أحداث الرواية عن منزل فى منطقة القناطر، وبها أحداث حقيقية وقعت بالفعل على أرض الواقع وتناقش فكرة هل هذا المنزل 'مسكون بجن' أم 'مسكون بعفاريت' أم 'مسكون بأرواح'.",
        },
        {
            id: 6,
            img: "/imgs/books/انا-شهيرة.webp",
            alt: "رواية انا شهيرة",
            width: "245",
            height: "300",
            title: "رواية انا شهيرة",
            pref: " كما بكيتها ابكيه لسنا قضاه ولا حكاما نحن جميعا مذنبون ويبقى وحده الغفور الرحيم ما خطية عمرى الكبرى؟ وماذنبى الاكبر؟ اننى احببته حتى الجنون واخلصت له بغباء لكنه رجل يستحق الحب والوفاء وها انا استعيد اليوم تلك اللحظات كاننى احياها من جديد كيف ومتى تولد البداية؟ كيف يغير الحب كل شئ ؟ وكيف فى نفس اللحظة وبنفس الرقة لا يبقى على شيء منا؟",
        },
        {
            id: 7,
            img: "/imgs/books/انتيخريستوس.webp",
            alt: "رواية انتيخريستوس",
            width: "245",
            height: "300",
            title: "رواية انتيخريستوس",
            pref: "لا تجعل العنوان او الغلاف يخدعك. و تتصور انك ستقرأ رواية تصنف.. ضمن روايات ادب الرعب. أنتيخريستوس ليست مجرد رواية ابطالها اعتبروا من اكثر الشخصيات رعباً انما هي رواية تاريخية من العيار الثقيل. فمثلاً اذا خيل لك انك تعرف دراكولا و انه فقط احدى شخصيات افلام الرعب فصدقني انك لا تعرفه.. احمد خالد سيثبت لك ان كل شخصية عرفتها يوماً على انها مجرد شخصية.. مرعبة..",
        },
        {
            id: 8,
            img: "/imgs/books/انا-الخائن.webp",
            alt: "رواية انا الخائن",
            width: "245",
            height: "300",
            title: "رواية انا الخائن",
            pref: "الجزء الثانى من هذه الثنائية يمثل الوجه الآخر لحكاية شهيرة، الذى خان و تمت خيانته، وكيف وقع فى الخيانة، وكيف أستقبلت ' شهيرة ' اعترافه، وتتركه، بعد أن قامت برد الخيانة، بوعى وبدافع الإنتقام والثأر لكرامة الشخصية لكن الأمر كان مريراً على كليهما، وفى تفاصيل هذه الرواية الثنائية نطالع عوالم كثيرة ذاتية وجمالية أقرب إلى الملحمة الإنسانية الكبيرة،",
        },
    ]
    return (
        <section className="hot">
            <div className="sec-title">
                <h1 className="shap">روايات مترجمة</h1>
            </div>
            <div className="container">
                <div className="row justify-content-center">
                    {Books.map(book => (
                        <div className="col-lg-3 col-md-4 col-sm-6 col-xs-12" key={book.id}>
                            <div className="book-item">
                                <div className="book-img">
                                    <img src={book.img} width={book.width} height={book.height} alt={book.alt} />
                                    <div className="book-cart">
                                        <a id='cartbtn' aria-label="btn" href='/'>
                                            <i className="fa fa-shopping-cart" aria-hidden="true"></i>
                                        </a>
                                    </div>
                                </div>
                                <div className="book-info">
                                    <a href="http://" target="_blank" aria-label="title" rel="noopener noreferrer">
                                        <h5>{book.title}</h5>
                                    </a>
                                    <p>{book.pref}</p>
                                </div>
                            </div>
                        </div>
                    ))}
                    <div className="col-12">
                        <div className="more-btn">
                            <Link to="/arabic" id="btn" className="btn btn-primary">المزيد</Link>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
}
export default Hot;